src/cf/src/Catalogs/Спринты/Спринты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спринты</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомандаСпринта</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСпринта</name>
    <type>
      <types>EnumRef.ТипыСпринтов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Спринты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Проверить на дубль по: Команда спринта, Дата начала.
	Если ЕстьДубльСпринта() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Уже есть созданный ранее спринт с такой командой.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
		
	// Формирование наименования.
	СтрокаДляНаименования = НСтр("ru = '%1-[%2]-[%3]'");
	СтрокаКомандаСпринта = ?(ЗначениеЗаполнено(КомандаСпринта), КомандаСпринта, "Команда не задана");
	Наименование = СтрШаблон(СтрокаДляНаименования, Формат(ДатаНачала,"ДФ=yyyy-MM-dd;"), ТипСпринта, СтрокаКомандаСпринта);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьДубльСпринта()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Спринты.Ссылка,
		|	Спринты.ДатаНачала,
		|	Спринты.КомандаСпринта
		|ИЗ
		|	Справочник.Спринты КАК Спринты
		|ГДЕ
		|	((Спринты.ДатаНачала = &ДатаНачала
		|	ИЛИ Спринты.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	ИЛИ Спринты.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	ИЛИ Спринты.ДатаНачала <= &ДатаНачала
		|	И Спринты.ДатаОкончания >= &ДатаОкончания)
		|	И Спринты.КомандаСпринта = &КомандаСпринта
		|	И Спринты.Ссылка <> &Ссылка
		|	И НЕ Спринты.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("КомандаСпринта", КомандаСпринта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество() > 0;
	
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
